public class Array2D {
    public static void main(String[] args) {
        /*
            Array 2 มิติ => เปรียบเสมือน matrix
            Array 2 มิติ
                ชนิดข้อมูล [][] ชื่อตัวแปร = {
                    {"เก้าอี้","โต๊ะ","โคมไฟ"},
                    {"คีย์บอร์ด","เมาส์","แป้นพิมพ์"},
                    {"ลิปติก","โรลออน","ครีม"}
                };
            การอ้างอิง ต้องเริ่มอ้างจาก row ก่อน แล้วจึงตามด้วย column
        */
        String [][] furni = {
            // col 0, col 1, col 2
            {"เก้าอี้","โต๊ะ","โคมไฟ"}, //row 0
            {"คีย์บอร์ด","เมาส์","แป้นพิมพ์"}, //row 1
            {"ลิปติก","โรลออน","ครีม"} //row 2
        };
        furni[1][1] = "แผ่นรองเมาส์";
        System.out.println(furni[1][1]);
    }
}
