public class ArrayBasic1 {
    public static void main(String[] args) {
        /* 
            Array
            ความหมาย 1 = ชุดตัวแปรที่อยู่ในรูปลำดับ ใช้เก็บค่าข้อมูลให้อยู่กลุ่มเดียวกัน ขนาด Array จะเล็กหรือใหญ่ ขึ้นกับจำนวนมิติที่กำหนดขึ้น
            ความหมาย 2 = เป็นตัวแปรที่ใช้เก็บข้อมูลที่มีลำดับต่อเนื่อง โดยใช้ชื่อ้างอิงชื่อเดียว และใช้หมายเลขกำกับ(index)เพื่อจำแนกความต่างของค่าตัวแปร

            คูณสมบัติ Array
            1. เก็บกลุ่มข้อมูล
            2. ข้อมูลที่อยู่ใน Array จะเรียกว่า สมาชิก หรือ element
            3. แต่ละ element จะเก็บค่าข้อมูล(value)และ (index) เอาไว้
            4. index หมายถึง คีย์ของ Array ใช้อ้างตำแหน่งของ element โดยเริ่มที่ 0
            5. สมาชิกใน Array ต้องมี data type เหมือนกัน
            6. สมาชิกใน Array จะถูกคั่นด้วยเครื่องหมาย comma
            7. มีขนาดที่แน่นอน

            การประกาศ
                ชนิดข้อมูล[]ชื่อตัวแปร = new ชนิดข้อมูล[ขนาด];
                int[]number = new int[4]; //เป็นเหมือนการจองตำแหน่งไว้ 4 ที่

                ชนิดข้อมูล[]ชื่อตัวแปร = {สมาชิก};

            การกำหนดค่า 
                num[0] = 10;
                num[1] = 10;
                num[2] = 10;

            การเปลี่ยนข้อมูลสมาชิก
                int[] number = {10,20,30,40};
                number[1] = 100; //จะเป็นการเปลี่ยนแปลงข้อมูล จาก 20 => 100
        */
        int [] number = new int [10]; //เป็นการจองตำแหน่งไว้ 4 ที่
        number [0] = 10;
        number [1] = 20;
        number [2] = 30;
        number [3] = 40;
        System.out.println("element ตำแหน่งที่ 3 = " + number[4]);
        
        String [] mammals = {"วาฬ","หมา","แมว"}; //เป็นการกำหนดสมาชิกโดยตรง มีขนาด 3 ตัว
        System.out.println("element ตำแหน่งที่ 1 = " + mammals[1]);
        mammals [0] = "พะยูน";
        System.out.println("element ตำแหน่งที่ 0 = " + mammals[0]);
        

    }
}
